Revit 2027 API
ViewSchedule.GetTableData Method
 Gets the writable table data object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableData GetTableData()
Public Function GetTableData As TableData
public:
TableData^ GetTableData()
member GetTableData : unit -> TableData
Return Value
TableData
 The schedule data object.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace